In [2368]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [2369]:
url=requests.get("https://en.wikipedia.org/wiki/Main_Page")
url

In [2370]:
soup=BeautifulSoup(url.content)

In [2371]:

head_=soup.find_all('span', class_="mw-headline")
head_

[<span class="mw-headline" id="From_today's_featured_article">From today's featured article</span>,
 <span class="mw-headline" id="Did_you_know_...">Did you know ...</span>,
 <span class="mw-headline" id="In_the_news">In the news</span>,
 <span class="mw-headline" id="On_this_day">On this day</span>,
 <span class="mw-headline" id="Today's_featured_picture">Today's featured picture</span>,
 <span class="mw-headline" id="Other_areas_of_Wikipedia">Other areas of Wikipedia</span>,
 <span class="mw-headline" id="Wikipedia's_sister_projects">Wikipedia's sister projects</span>,
 <span class="mw-headline" id="Wikipedia_languages">Wikipedia languages</span>]

In [2372]:
head = []
for i in head_:
    head.append(i.get_text())
head

["From today's featured article",
 'Did you know\xa0...',
 'In the news',
 'On this day',
 "Today's featured picture",
 'Other areas of Wikipedia',
 "Wikipedia's sister projects",
 'Wikipedia languages']

In [2373]:
bs= BeautifulSoup()

In [2374]:
url=requests.get("https://www.imdb.com/chart/top/")
url

In [2375]:
soup=BeautifulSoup(url.content)

In [2376]:
movie_data=soup.find_all("td",class_="titleColumn")

In [2377]:
movie_name=[]
for i in movie_data:
    for j in i.find_all('a'):
        movie_name.append(j.text.replace('\n',' '))
movie_name[:10]

['The Shawshank Redemption',
 'The Godfather',
 'The Godfather: Part II',
 'The Dark Knight',
 '12 Angry Men',
 "Schindler's List",
 'The Lord of the Rings: The Return of the King',
 'Pulp Fiction',
 'Il buono, il brutto, il cattivo',
 'The Lord of the Rings: The Fellowship of the Ring']

In [2576]:
len(movie_name)

250

In [2379]:
year_data=soup.find_all('span', class_="secondaryInfo")

In [2380]:
movie_year=[]
for i in year_data:
        movie_year.append(i.text.replace("("," ").replace(")"," "))
movie_year[:10]

[' 1994 ',
 ' 1972 ',
 ' 1974 ',
 ' 2008 ',
 ' 1957 ',
 ' 1993 ',
 ' 2003 ',
 ' 1994 ',
 ' 1966 ',
 ' 2001 ']

In [2381]:
len(movie_year)

250

In [2382]:
Rating_data=soup.find_all('td' ,class_="ratingColumn imdbRating")

In [2383]:
movie_rating=[]
for i in Rating_data:
        movie_rating.append(i.text.replace('\n',' '))
movie_rating[:10]

[' 9.2 ',
 ' 9.1 ',
 ' 9.0 ',
 ' 9.0 ',
 ' 8.9 ',
 ' 8.9 ',
 ' 8.9 ',
 ' 8.8 ',
 ' 8.8 ',
 ' 8.8 ']

In [2384]:
Movie_df=pd.DataFrame({"Name of movie":movie_name[0:100],"Year of release":movie_year[0:100],"Rating for the movie":movie_rating[0:100]})

In [2385]:
Movie_df

                            Name of movie Year of release Rating for the movie
0                The Shawshank Redemption           1994                  9.2
1                           The Godfather           1972                  9.1
2                  The Godfather: Part II           1974                  9.0
3                         The Dark Knight           2008                  9.0
4                            12 Angry Men           1957                  8.9
..                                    ...             ...                  ...
95                                 Jagten           2012                  8.3
96                    Singin' in the Rain           1952                  8.3
97                     North by Northwest           1959                  8.3
98                           Idi i smotri           1985                  8.3
99  Eternal Sunshine of the Spotless Mind           2004                  8.3

[100 rows x 3 columns]

# TOP 100 INDIAN MOVIE

In [2386]:
url=requests.get("https://www.imdb.com/india/top-rated-indian-movies/")
url

In [2387]:
soup=BeautifulSoup(url.content)

In [2577]:
movie_data=soup.find_all("td",class_="titleColumn")

In [2389]:
movie_name=[]
for i in movie_data:
    for j in i.find_all('a'):
        movie_name.append(j.text.replace('\n',' '))
movie_name[:10]

['Pather Panchali',
 'Nayakan',
 'Pariyerum Perumal',
 'Anbe Sivam',
 'Golmaal',
 'Apur Sansar',
 'C/o Kancharapalem',
 'Kireedam',
 'Manichitrathazhu',
 'Natsamrat']

In [2390]:
year_data=soup.find_all('span', class_="secondaryInfo")

In [2391]:
movie_year=[]
for i in year_data:
        movie_year.append(i.text.replace("("," ").replace(")"," "))
movie_year[:10]

[' 1955 ',
 ' 1987 ',
 ' 2018 ',
 ' 2003 ',
 ' 1979 ',
 ' 1959 ',
 ' 2018 ',
 ' 1989 ',
 ' 1993 ',
 ' 2016 ']

In [2392]:
Rating_data=soup.find_all('td' ,class_="ratingColumn imdbRating")

In [2393]:
movie_rating=[]
for i in Rating_data:
        movie_rating.append(i.text.replace('\n',' '))
movie_rating[:10]

[' 8.5 ',
 ' 8.5 ',
 ' 8.5 ',
 ' 8.5 ',
 ' 8.5 ',
 ' 8.5 ',
 ' 8.5 ',
 ' 8.4 ',
 ' 8.4 ',
 ' 8.4 ']

In [2394]:
Indian_Movie_df=pd.DataFrame({"Name of movie":movie_name[0:100],"Year of release":movie_year[0:100],"Rating for the movie":movie_rating[0:100]})
Indian_Movie_df

               Name of movie Year of release Rating for the movie
0            Pather Panchali           1955                  8.5
1                    Nayakan           1987                  8.5
2          Pariyerum Perumal           2018                  8.5
3                 Anbe Sivam           2003                  8.5
4                    Golmaal           1979                  8.5
..                       ...             ...                  ...
95           Andaz Apna Apna           1994                  8.1
96  Uri: The Surgical Strike           2018                  8.1
97                 Virumandi           2004                  8.1
98                        PK           2014                  8.1
99                     Lucia           2013                  8.1

[100 rows x 3 columns]

 Write a python program to scrap book name, author name, genre and book review of any 5 books from ‘www.bookpage.com’.

In [2395]:
url=requests.get("https://bookpage.com/reviews")
url

In [2396]:
soup=BeautifulSoup(url.content)

In [2397]:
book_name=soup.find_all('h4',class_="italic")

In [2398]:
name_of_book=[]
for i in book_name:
    name_of_book.append(i.text.replace("\n"," ").replace(" ★"," "))
name_of_book[:5]

['   The Ugly Cry ',
 '   Indestructible Object ',
 '   How the Word Is Passed ',
 '   Seven Days in June ',
 '   The Other Black Girl ']

In [2399]:
book_author=soup.find_all('p', class_="sans bold")
book_author

[<p class="sans bold">
 Danielle Henderson
 </p>,
 <p class="sans bold">
 Mary McCoy
 </p>,
 <p class="sans bold">
 Clint Smith
 </p>,
 <p class="sans bold">
 Tia Williams
 </p>,
 <p class="sans bold">
 Zakiya Dalila Harris
 </p>,
 <p class="sans bold">
 Nana Nkweti
 </p>,
 <p class="sans bold">
 Taylor Jenkins Reid
 </p>,
 <p class="sans bold">
 Jules Machias
 </p>,
 <p class="sans bold">
 Marianne Cronin
 </p>,
 <p class="sans bold">
 Rachel Lynn Solomon
 </p>]

In [2400]:
name_of_author=[]
for i in book_author:
    name_of_author.append(i.text.replace("\n"," "))
name_of_author[:5]

[' Danielle Henderson ',
 ' Mary McCoy ',
 ' Clint Smith ',
 ' Tia Williams ',
 ' Zakiya Dalila Harris ']

In [2401]:
book_genre=soup.find_all('p',class_="genre-links hidden-phone")

In [2402]:
genre_of_book=[]
for i in book_genre:
    genre_of_book.append(i.text.replace("\n"," "))
genre_of_book[:5]

[' Nonfiction  /  Memoir ',
 ' YA  /  YA Fiction ',
 ' Nonfiction  /  American History  /  African American History ',
 ' Romance  /  Contemporary Romance ',
 ' Fiction  /  Literary Fiction ']

In [2403]:
book_review=soup.find_all('p', class_="excerpt")
book_review

[<p class="excerpt">
 Danielle Henderson brings her family to life using humor as quick and sharp as the violence she survived as a child.
 </p>,
 <p class="excerpt">
 </p>,
 <p class="excerpt">
 Clint Smith's gifts as both a poet and a scholar make <strong>How the Word Is Passed </strong>a richly provocative read.
 </p>,
 <p class="excerpt">
 Readers will feel as attached to Tia Williams’ characters as Eva and Shane are to each other.
 </p>,
 <p class="excerpt">
 Brilliantly positioned at the intersection of satire and social horror, Zakiya Dalila Harris’ debut novel is a genre-bending creative triumph.
 </p>,
 <p class="excerpt">
 With the ease of a master, Nana Nkweti shifts between points of view, between American and African slang, and between the straightforward and the avant-garde.
 </p>,
 <p class="excerpt">
 <strong>Malibu Rising</strong> is packed with plenty of scintillating scandal, but Taylor Jenkins Reid’s irresistible characters are the novel’s greatest success.
 </p>,
 <p class="excerpt">
 </p>,
 <p class="excerpt">
 Even in the face of death’s inevitability, friendship can be found, forgiveness can flourish and fun can ease fear.
 </p>,
 <p class="excerpt">
 </p>]

In [2404]:
review_of_book=[]
for i in book_review:
    review_of_book.append(i.text.replace("\n"," "))
review_of_book[:5]

[' Danielle Henderson brings her family to life using humor as quick and sharp as the violence she survived as a child. ',
 ' ',
 " Clint Smith's gifts as both a poet and a scholar make How the Word Is Passed a richly provocative read. ",
 ' Readers will feel as attached to Tia Williams’ characters as Eva and Shane are to each other. ',
 ' Brilliantly positioned at the intersection of satire and social horror, Zakiya Dalila Harris’ debut novel is a genre-bending creative triumph. ']

In [2405]:
book_scrap=pd.DataFrame({"Book Name":name_of_book[5:10],"Author Name":name_of_author[5:10],"Book Genre":genre_of_book[5:10],"Book Review":review_of_book[5:10]})

In [2406]:
book_scrap

,Book Name,Author Name,Book Genre,Book Review
0,Walking on Cowrie Shells,Nana Nkweti,Fiction / Short Stories,"With the ease of a master, Nana Nkweti shifts..."
1,Malibu Rising,Taylor Jenkins Reid,Fiction / Popular Fiction,Malibu Rising is packed with plenty of scinti...
2,Both Can Be True,Jules Machias,Children's / Middle Grade,
3,The One Hundred Years of Lenni and Margot,Marianne Cronin,Fiction / Popular Fiction,"Even in the face of death’s inevitability, fr..."
4,We Can’t Keep Meeting Like This,Rachel Lynn Solomon,YA / YA Fiction,

5. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

In [2407]:
url=requests.get("https://www.icc-cricket.com/rankings/mens/team-rankings/odi")
url

In [2408]:
soup=BeautifulSoup(url.content)

In [2409]:
cricket_top_10=soup.find_all('tr', class_="table-body")

In [2410]:
cricket_team=[]
cricket_match=[]
cricket_point=[]
cricket_rating=[]

In [2411]:
team=soup.find_all('span' ,class_="u-hide-phablet")

In [2412]:
for i in team:
    cricket_team.append(i.text.replace("\n"," "))
cricket_team[1:10]

['Australia',
 'India',
 'England',
 'South Africa',
 'Pakistan',
 'Bangladesh',
 'West Indies',
 'Sri Lanka',
 'Afghanistan']

In [2413]:
match=soup.find_all('td' ,class_="table-body__cell u-center-text")

In [2414]:
for i in  range(0,len(match),2):
    cricket_match.append(match[i].text)
cricket_match[:10]

['25', '29', '27', '20', '24', '27', '27', '24', '17', '20']

In [2415]:
for i in  range(1,len(match),2):
    cricket_point.append(match[i].text)
cricket_point[:10]

['2,945',
 '3,344',
 '3,100',
 '2,137',
 '2,323',
 '2,438',
 '2,222',
 '1,876',
 '1,054',
 '907']

In [2416]:
rating=soup.find_all("td", class_="table-body__cell u-text-right rating")

In [2417]:
for i in rating:
    cricket_rating.append(i.text.replace("\n"," "))
cricket_rating[:10]

['118', '115', '115', '107', '97', '90', '82', '78', '62', '45']

In [2418]:
len(cricket_rating)

19

In [2419]:
len(cricket_point)

19

In [2420]:
top_10=pd.DataFrame({"Team":cricket_team[1:10],"Matches":cricket_match[:9],"Point":cricket_point[:9],"Rating":cricket_rating[:9]})

In [2421]:
top_10

           Team Matches  Point Rating
0     Australia      25  2,945    118
1         India      29  3,344    115
2       England      27  3,100    115
3  South Africa      20  2,137    107
4      Pakistan      24  2,323     97
5    Bangladesh      27  2,438     90
6   West Indies      27  2,222     82
7     Sri Lanka      24  1,876     78
8   Afghanistan      17  1,054     62

In [2422]:
name_banner_=soup.find_all('span' ,class_="u-hide-phablet")

In [2423]:
name_banner=[]
for i in name_banner_:
    name_banner.append(i.text.replace("\n"," "))
name_banner[:1]

['New Zealand']

In [2424]:
match_banner_=soup.find_all('td', class_="rankings-block__banner--matches")
match_banner_

In [2425]:
match_banner=[]
for i in match_banner_:
    match_banner.append(i.text.replace("\n"," "))
match_banner

['17']

In [2426]:
point_banner_=soup.find_all('td' ,class_="rankings-block__banner--points")
point_banner_

In [2427]:
point_banner=[]
for i in point_banner_:
    point_banner.append(i.text.replace("\n"," "))
point_banner

['2,054']

In [2428]:
rating_banner_=soup.find_all('td' ,class_="rankings-block__banner--rating u-text-right")
rating_banner_

[<td class="rankings-block__banner--rating u-text-right">
                             121
                             <span class="circle-branding circle-branding--top"></span>
 <span class="circle-branding circle-branding--bottom"></span>
 </td>]

In [2429]:
rating_banner=[]
for i in rating_banner_:
    rating_banner.append(i.text.replace("\n","").replace("  ",""))
rating_banner

['121']

In [2430]:
len(name_banner)

25

In [2431]:
len(point_banner)

1

In [2432]:
banner=pd.DataFrame({"Team":name_banner[:1],"Matches":match_banner[:1],"Point":point_banner[:1],"Rating":rating_banner[:1]})
banner

          Team Matches  Point Rating
0  New Zealand      17  2,054    121

In [2433]:
ODI_TOP=banner.append(top_10,ignore_index=True)
ODI_TOP

           Team Matches  Point Rating
0   New Zealand      17  2,054    121
1     Australia      25  2,945    118
2         India      29  3,344    115
3       England      27  3,100    115
4  South Africa      20  2,137    107
5      Pakistan      24  2,323     97
6    Bangladesh      27  2,438     90
7   West Indies      27  2,222     82
8     Sri Lanka      24  1,876     78
9   Afghanistan      17  1,054     62

> ii. Top 10 ODI Batsmen in men along with the records of their team and rating.

In [2434]:
url=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi/Batting")
url

In [2435]:
soup=BeautifulSoup(url.content)

In [2436]:
name=soup.find_all('td' ,class_="table-body__cell rankings-table__name name")

In [2437]:
player_name=[]
player_team=[]
player_point=[]

In [2438]:
for i in name:
    player_name.append(i.text.replace("\n"," "))
player_name[:9]

[' Virat Kohli ',
 ' Rohit Sharma ',
 ' Ross Taylor ',
 ' Aaron Finch ',
 ' Jonny Bairstow ',
 ' Fakhar Zaman ',
 ' Francois du Plessis ',
 ' David Warner ',
 ' Shai Hope ']

In [2439]:
team=soup.find_all('span' ,class_="table-body__logo-text")
team[:1]

In [2440]:
for i in team:
    player_team.append(i.text.replace("\n"," "))
player_team[:9]

['IND', 'IND', 'NZ', 'AUS', 'ENG', 'PAK', 'SA', 'AUS', 'WI']

In [2441]:
point=soup.find_all('td' ,class_="table-body__cell rating")
point[:1]

In [2442]:
for i in point:
    player_point.append(i.text.replace("\n",""))
player_point[:9]

['857', '825', '801', '791', '785', '778', '778', '773', '773']

In [2443]:
top_10_players_=pd.DataFrame({"Name":player_name[:9],"Team":player_team[:9],"Points":player_point[:9]})
top_10_players_

                    Name Team Points
0           Virat Kohli   IND    857
1          Rohit Sharma   IND    825
2           Ross Taylor    NZ    801
3           Aaron Finch   AUS    791
4        Jonny Bairstow   ENG    785
5          Fakhar Zaman   PAK    778
6   Francois du Plessis    SA    778
7          David Warner   AUS    773
8             Shai Hope    WI    773

In [2444]:
name_banner=[]
team_banner=[]
point_banner=[]

In [2445]:
name_banner_=soup.find_all('div', class_="rankings-block__banner--name-large")
name_banner_

In [2446]:
for i in name_banner_:
    name_banner.append(i.text.replace("\n"," "))
name_banner

['Babar Azam']

In [2447]:
team_banner_=soup.find_all("div", class_="rankings-block__banner--nationality")
team_banner_

[<div class="rankings-block__banner--nationality">
 <div class="flag-15 PAK"></div>
 <span class="rankings-block__banner--nation"></span>PAK
                     </div>]

In [2448]:
for i in team_banner_:
        team_banner.append(i.text.strip())
team_banner

['PAK']

In [2449]:
point_banner_=soup.find_all('div' ,class_="rankings-block__banner--rating")
point_banner_

In [2450]:
for i in point_banner_:
    point_banner.append(i.text.replace("\n",""))
point_banner

['865']

In [2451]:
banner_player=pd.DataFrame({"Name":name_banner[:1],"Team":team_banner[:1],"Points":point_banner[:1]})
banner_player

         Name Team Points
0  Babar Azam  PAK    865

In [2452]:
top_10_player=banner_player.append(top_10_players_,ignore_index=True)
top_10_player

                    Name Team Points
0             Babar Azam  PAK    865
1           Virat Kohli   IND    857
2          Rohit Sharma   IND    825
3           Ross Taylor    NZ    801
4           Aaron Finch   AUS    791
5        Jonny Bairstow   ENG    785
6          Fakhar Zaman   PAK    778
7   Francois du Plessis    SA    778
8          David Warner   AUS    773
9             Shai Hope    WI    773

 iii. Top 10 ODI bowlers along with the records of their team and rating.

In [2453]:
url=requests.get("https://www.icc-cricket.com/rankings/mens/player-rankings/odi/Bowling")
url

In [2454]:
soup=BeautifulSoup(url.content)

In [2455]:
bowler_name=[]
bowler_team=[]
bowler_point=[]

In [2456]:
bowler_name_=soup.find_all('td' ,class_="table-body__cell rankings-table__name name")
bowler_name_[:1]

[<td class="table-body__cell rankings-table__name name">
 <a href="/rankings/mens/player-rankings/1597">Mehedi Hasan</a>
 </td>]

In [2457]:
for i in  bowler_name_:
    bowler_name.append(i.text.replace("\n"," "))
bowler_name[:9]

[' Mehedi Hasan ',
 ' Mujeeb Ur Rahman ',
 ' Matt Henry ',
 ' Jasprit Bumrah ',
 ' Kagiso Rabada ',
 ' Chris Woakes ',
 ' Josh Hazlewood ',
 ' Pat Cummins ',
 ' Mustafizur Rahman ']

In [2458]:
bowler_team_=soup.find_all('span' ,class_="table-body__logo-text")
bowler_team_[:1]

In [2459]:
for i in bowler_team_:
    bowler_team.append(i.text.replace("\n"," "))
bowler_team[:9]

['BAN', 'AFG', 'NZ', 'IND', 'SA', 'ENG', 'AUS', 'AUS', 'BAN']

In [2460]:
bowler_point_=soup.find_all("td", class_="table-body__cell rating")
bowler_point_[:1]

In [2461]:
for i in bowler_point_:
    bowler_point.append(i.text.replace("\n", ""))
bowler_point[:9]

['713', '708', '691', '690', '666', '665', '660', '646', '645']

In [2462]:
Top_10_bowlers_=pd.DataFrame({"Player":bowler_name[:9],"Team":bowler_team[:9],"Rating":bowler_point[:9]})
Top_10_bowlers_

                Player Team Rating
0        Mehedi Hasan   BAN    713
1    Mujeeb Ur Rahman   AFG    708
2          Matt Henry    NZ    691
3      Jasprit Bumrah   IND    690
4       Kagiso Rabada    SA    666
5        Chris Woakes   ENG    665
6      Josh Hazlewood   AUS    660
7         Pat Cummins   AUS    646
8   Mustafizur Rahman   BAN    645

In [2463]:
banner_name=[]
banner_team=[]
banner_point=[]

In [2464]:
banner_name_=soup.find_all('div' ,class_="rankings-block__banner--name-large")
banner_name_

In [2465]:
for i in banner_name_:
    banner_name.append(i.text.replace("\n"," "))
banner_name

['Trent Boult']

In [2466]:
banner_team_=soup.find_all('div' ,class_="rankings-block__banner--nationality")
banner_team_

[<div class="rankings-block__banner--nationality">
 <div class="flag-15 NZ"></div>
 <span class="rankings-block__banner--nation"></span>NZ
                     </div>]

In [2467]:
for i in banner_team_:
       banner_team.append(i.text.strip())
banner_team

['NZ']

In [2468]:
banner_point_=soup.find_all("div" ,class_="rankings-block__banner--rating")
banner_point_

In [2469]:
for i in banner_point_:
    banner_point.append(i.text.replace("\n"," "))
banner_point

['737']

In [2470]:
banner_bowler=pd.DataFrame({"Player":banner_name,"Team":banner_team,"Rating":banner_point})
banner_bowler

        Player Team Rating
0  Trent Boult   NZ    737

In [2471]:
Top_10_bowlers=banner_bowler.append(Top_10_bowlers_,ignore_index=True)
Top_10_bowlers

                Player Team Rating
0          Trent Boult   NZ    737
1        Mehedi Hasan   BAN    713
2    Mujeeb Ur Rahman   AFG    708
3          Matt Henry    NZ    691
4      Jasprit Bumrah   IND    690
5       Kagiso Rabada    SA    666
6        Chris Woakes   ENG    665
7      Josh Hazlewood   AUS    660
8         Pat Cummins   AUS    646
9   Mustafizur Rahman   BAN    645

6.Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

i. Top 10 ODI teams in women’s cricket along with the records for matches, points and rating

In [2472]:
url=requests.get("https://www.icc-cricket.com/rankings/womens/team-rankings/odi")
url

In [2473]:
soup=BeautifulSoup(url.content)

In [2474]:
women_team_=soup.find_all('span', class_='u-hide-phablet')
women_team_[1:10]

[<span class="u-hide-phablet">South Africa</span>,
 <span class="u-hide-phablet">England</span>,
 <span class="u-hide-phablet">India</span>,
 <span class="u-hide-phablet">New Zealand</span>,
 <span class="u-hide-phablet">West Indies</span>,
 <span class="u-hide-phablet">Pakistan</span>,
 <span class="u-hide-phablet">Bangladesh</span>,
 <span class="u-hide-phablet">Sri Lanka</span>,
 <span class="u-hide-phablet">Ireland</span>]

In [2475]:
women_team=[]
women_match=[]
women_point=[]
women_rating=[]

In [2476]:
for i in women_team_:
    women_team.append(i.text.replace("\n"," "))
women_team[1:10]

['South Africa',
 'England',
 'India',
 'New Zealand',
 'West Indies',
 'Pakistan',
 'Bangladesh',
 'Sri Lanka',
 'Ireland']

In [2477]:
women_match_=soup.find_all('td', class_='table-body__cell u-center-text')
women_match_

[<td class="table-body__cell u-center-text">24</td>,
 <td class="table-body__cell u-center-text">2,828</td>,
 <td class="table-body__cell u-center-text">17</td>,
 <td class="table-body__cell u-center-text">1,993</td>,
 <td class="table-body__cell u-center-text">20</td>,
 <td class="table-body__cell u-center-text">2,226</td>,
 <td class="table-body__cell u-center-text">21</td>,
 <td class="table-body__cell u-center-text">1,947</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">1,025</td>,
 <td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,101</td>,
 <td class="table-body__cell u-center-text">5</td>,
 <td class="table-body__cell u-center-text">306</td>,
 <td class="table-body__cell u-center-text">11</td>,
 <td class="table-body__cell u-center-text">519</td>,
 <td class="table-body__cell u-center-text">2</td>,
 <td class="table-body__cell u-center-text">25</td>]

In [2478]:
for i in  range(0,len(women_match_),2):
    women_match.append(women_match_[i].text)
women_match[:9]

['24', '17', '20', '21', '12', '15', '5', '11', '2']

In [2479]:
for i in  range(1,len(women_match_),2):
    women_point.append(women_match_[i].text)
women_point[:9]

['2,828', '1,993', '2,226', '1,947', '1,025', '1,101', '306', '519', '25']

In [2480]:
women_rating_=soup.find_all('td', class_='table-body__cell u-text-right rating')
women_rating_

[<td class="table-body__cell u-text-right rating">118</td>,
 <td class="table-body__cell u-text-right rating">117</td>,
 <td class="table-body__cell u-text-right rating">111</td>,
 <td class="table-body__cell u-text-right rating">93</td>,
 <td class="table-body__cell u-text-right rating">85</td>,
 <td class="table-body__cell u-text-right rating">73</td>,
 <td class="table-body__cell u-text-right rating">61</td>,
 <td class="table-body__cell u-text-right rating">47</td>,
 <td class="table-body__cell u-text-right rating">13</td>]

In [2481]:
for i in women_rating_:
    women_rating.append(i.text.replace("\n"," "))
women_rating

['118', '117', '111', '93', '85', '73', '61', '47', '13']

In [2482]:
print(len(women_match),len(women_point),len(women_team),len(women_rating))

9 9 15 9

In [2483]:
women_top_10_=pd.DataFrame({"Team":women_team[1:10],"Matches":women_match[0:10],"Points":women_point[0:10],"Ratings":women_rating})
women_top_10_

           Team Matches Points Ratings
0  South Africa      24  2,828     118
1       England      17  1,993     117
2         India      20  2,226     111
3   New Zealand      21  1,947      93
4   West Indies      12  1,025      85
5      Pakistan      15  1,101      73
6    Bangladesh       5    306      61
7     Sri Lanka      11    519      47
8       Ireland       2     25      13

In [2484]:
women_team_banner=[]
women_match_banner=[]
women_point_banner=[]
women_rating_banner=[]

In [2485]:
women_team_banner_=soup.find_all('span' ,class_="u-hide-phablet")
women_team_banner_

[<span class="u-hide-phablet">Australia</span>,
 <span class="u-hide-phablet">South Africa</span>,
 <span class="u-hide-phablet">England</span>,
 <span class="u-hide-phablet">India</span>,
 <span class="u-hide-phablet">New Zealand</span>,
 <span class="u-hide-phablet">West Indies</span>,
 <span class="u-hide-phablet">Pakistan</span>,
 <span class="u-hide-phablet">Bangladesh</span>,
 <span class="u-hide-phablet">Sri Lanka</span>,
 <span class="u-hide-phablet">Ireland</span>,
 <span class="icn icn-facebook-circle u-hide-phablet"></span>,
 <span class="icn icn-twitter-circle u-hide-phablet"></span>,
 <span class="icn icn-instagram-circle u-hide-phablet"></span>,
 <span class="icn icn-youtube-circle u-hide-phablet"></span>,
 <span class="icn icn-tiktok-circle u-hide-phablet"></span>]

In [2486]:
for i in women_team_banner_:
     women_team_banner.append(i.text.replace("\n"," "))
women_team_banner[:1]

['Australia']

In [2487]:
women_match_banner_=soup.find_all('td', class_="rankings-block__banner--matches")
women_match_banner_

In [2488]:
for i in women_match_banner_:
    women_match_banner.append(i.text.replace("\n"," "))
women_match_banner

['18']

In [2489]:
women_point_banner_=soup.find_all('td' ,class_="rankings-block__banner--points")
women_point_banner_

In [2490]:
for i in women_point_banner_:
    women_point_banner.append(i.text.replace("\n"," "))
women_point_banner

['2,955']

In [2491]:
women_rating_banner_=soup.find_all('td',class_ ="rankings-block__banner--rating u-text-right")
women_rating_banner_

[<td class="rankings-block__banner--rating u-text-right">
                             164
                             <span class="circle-branding circle-branding--top"></span>
 <span class="circle-branding circle-branding--bottom"></span>
 </td>]

In [2492]:
for i in women_rating_banner_:
    women_rating_banner.append(i.text.replace("\n"," ").replace(" ",""))

women_rating_banner

['164']

In [2493]:
banner_=pd.DataFrame({"Team":women_team_banner[:1],"Matches":women_match_banner,"Points":women_point_banner,"Ratings":women_rating_banner})

In [2494]:
banner_

        Team Matches Points Ratings
0  Australia      18  2,955     164

In [2495]:
women_top_10=banner_.append(women_top_10_,ignore_index=True)
women_top_10

           Team Matches Points Ratings
0     Australia      18  2,955     164
1  South Africa      24  2,828     118
2       England      17  1,993     117
3         India      20  2,226     111
4   New Zealand      21  1,947      93
5   West Indies      12  1,025      85
6      Pakistan      15  1,101      73
7    Bangladesh       5    306      61
8     Sri Lanka      11    519      47
9       Ireland       2     25      13

# ii. Top 10 women’s ODI players along with the records of their team and rating.

In [2496]:
url=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting")
url

In [2497]:
#url.content

In [2498]:
soup=BeautifulSoup(url.content)
#soup

In [2499]:
#print(soup.prettify)

In [2500]:
women_player=[]
women_team=[]
women_rating=[]

In [2501]:
women_player_=soup.find_all('td', class_='table-body__cell rankings-table__name name')
women_player_ [:10]

[<td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/1785">Lizelle Lee</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/466">Alyssa Healy</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/573">Stafanie Taylor</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/469">Meg Lanning</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/487">Amy Satterthwaite</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/1809">Smriti Mandhana</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/558">Mithali Raj</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/1800">Natalie Sciver</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/3176">Laura Wolvaardt</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/471">Ellyse Perry</a>
 </td>]

In [2502]:
for i in women_player_:
    women_player.append(i.text.replace("\n"," "))
women_player[:9]

[' Lizelle Lee ',
 ' Alyssa Healy ',
 ' Stafanie Taylor ',
 ' Meg Lanning ',
 ' Amy Satterthwaite ',
 ' Smriti Mandhana ',
 ' Mithali Raj ',
 ' Natalie Sciver ',
 ' Laura Wolvaardt ']

In [2503]:
women_team_=soup.find_all('span', class_="table-body__logo-text")
women_team_[:9]

[<span class="table-body__logo-text">SA</span>,
 <span class="table-body__logo-text">AUS</span>,
 <span class="table-body__logo-text">WI</span>,
 <span class="table-body__logo-text">AUS</span>,
 <span class="table-body__logo-text">NZ</span>,
 <span class="table-body__logo-text">IND</span>,
 <span class="table-body__logo-text">IND</span>,
 <span class="table-body__logo-text">ENG</span>,
 <span class="table-body__logo-text">SA</span>]

In [2504]:
for i in women_team_:
    women_team.append(i.text.replace("\n"," "))
women_team[:9]

['SA', 'AUS', 'WI', 'AUS', 'NZ', 'IND', 'IND', 'ENG', 'SA']

In [2505]:
women_rating_=soup.find_all('td' ,class_="table-body__cell rating")
women_rating_[:9]

[<td class="table-body__cell rating">758</td>,
 <td class="table-body__cell rating">756</td>,
 <td class="table-body__cell rating">746</td>,
 <td class="table-body__cell rating">723</td>,
 <td class="table-body__cell rating">715</td>,
 <td class="table-body__cell rating">710</td>,
 <td class="table-body__cell rating">709</td>,
 <td class="table-body__cell rating">685</td>,
 <td class="table-body__cell rating">683</td>]

In [2506]:
for i in women_rating_:
    women_rating.append(i.text.replace("\n"," "))
women_rating[:9]

['758', '756', '746', '723', '715', '710', '709', '685', '683']

In [2507]:
women_top=pd.DataFrame({"Player":women_player[0:9],"Team":women_team[0:9],"Rating":women_rating[0:9]})
women_top

                Player Team Rating
0         Lizelle Lee    SA    758
1        Alyssa Healy   AUS    756
2     Stafanie Taylor    WI    746
3         Meg Lanning   AUS    723
4   Amy Satterthwaite    NZ    715
5     Smriti Mandhana   IND    710
6         Mithali Raj   IND    709
7      Natalie Sciver   ENG    685
8     Laura Wolvaardt    SA    683

In [2508]:
w_player_banner=[]
w_team_banner=[]
w_rating_banner=[]

In [2509]:
w_player_banner_=soup.find_all("div" ,class_="rankings-block__banner--name-large")
w_player_banner_

In [2510]:
for i in w_player_banner_:
    w_player_banner.append(i.text.replace("\n"," "))
w_player_banner

['Tammy Beaumont']

In [2511]:
w_team_banner_=soup.find_all("div" ,class_="rankings-block__banner--nationality")
w_team_banner_

[<div class="rankings-block__banner--nationality">
 <div class="flag-15 ENG"></div>
 <span class="rankings-block__banner--nation"></span>ENG
                     </div>]

In [2512]:
for i in w_team_banner_:
    w_team_banner.append(i.text.strip())
w_team_banner[:1]

['ENG']

In [2513]:
w_rating_banner_=soup.find_all('div' ,class_="rankings-block__banner--rating")
w_rating_banner_

In [2514]:
for i in w_rating_banner_:
    w_rating_banner.append(i.text.replace("\n"," "))
w_rating_banner

['765']

In [2515]:
print(len(w_player_banner),len(w_team_banner),len(w_rating_banner))

1 1 1

In [2516]:
w_banner=pd.DataFrame({"Player":w_player_banner,"Team":w_team_banner[:1],"Rating":w_rating_banner})
w_banner

           Player Team Rating
0  Tammy Beaumont  ENG    765

In [2517]:
women_top_=w_banner.append(women_top,ignore_index=True)
women_top_

                Player Team Rating
0       Tammy Beaumont  ENG    765
1         Lizelle Lee    SA    758
2        Alyssa Healy   AUS    756
3     Stafanie Taylor    WI    746
4         Meg Lanning   AUS    723
5   Amy Satterthwaite    NZ    715
6     Smriti Mandhana   IND    710
7         Mithali Raj   IND    709
8      Natalie Sciver   ENG    685
9     Laura Wolvaardt    SA    683

# iii. Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [2518]:
url=requests.get("https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder")
url

In [2519]:
#url.content

In [2520]:
soup=BeautifulSoup(url.content)
#soup

In [2521]:
#print(soup.prettify)

In [2522]:
a_player=[]
a_team=[]
a_rating=[]

In [2523]:
a_player_=soup.find_all('td' ,class_="table-body__cell rankings-table__name name")
a_player_[:9]

[<td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/471">Ellyse Perry</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/573">Stafanie Taylor</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/1800">Natalie Sciver</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/3192">Deepti Sharma</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/468">Jess Jonassen</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/4128">Ashleigh Gardner</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/430">Dane van Niekerk</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/478">Sophie Devine</a>
 </td>,
 <td class="table-body__cell rankings-table__name name">
 <a href="/rankings/womens/player-rankings/3756">Amelia Kerr</a>
 </td>]

In [2524]:
for i in a_player_:
    a_player.append(i.text.replace("\n"," "))
a_player[:9]

[' Ellyse Perry ',
 ' Stafanie Taylor ',
 ' Natalie Sciver ',
 ' Deepti Sharma ',
 ' Jess Jonassen ',
 ' Ashleigh Gardner ',
 ' Dane van Niekerk ',
 ' Sophie Devine ',
 ' Amelia Kerr ']

In [2525]:
a_team_=soup.find_all('span', class_="table-body__logo-text")
a_team_[:9]

[<span class="table-body__logo-text">AUS</span>,
 <span class="table-body__logo-text">WI</span>,
 <span class="table-body__logo-text">ENG</span>,
 <span class="table-body__logo-text">IND</span>,
 <span class="table-body__logo-text">AUS</span>,
 <span class="table-body__logo-text">AUS</span>,
 <span class="table-body__logo-text">SA</span>,
 <span class="table-body__logo-text">NZ</span>,
 <span class="table-body__logo-text">NZ</span>]

In [2526]:
for i in a_team_:
    a_team.append(i.text.replace("\n"," "))
a_team[:9]

['AUS', 'WI', 'ENG', 'IND', 'AUS', 'AUS', 'SA', 'NZ', 'NZ']

In [2527]:
a_rating_=soup.find_all('td' ,class_="table-body__cell rating")
a_rating_[:9]

[<td class="table-body__cell rating">418</td>,
 <td class="table-body__cell rating">410</td>,
 <td class="table-body__cell rating">349</td>,
 <td class="table-body__cell rating">343</td>,
 <td class="table-body__cell rating">307</td>,
 <td class="table-body__cell rating">252</td>,
 <td class="table-body__cell rating">243</td>,
 <td class="table-body__cell rating">242</td>,
 <td class="table-body__cell rating">236</td>]

In [2528]:
for i in a_rating_:
    a_rating.append(i.text.replace("\n"," "))
a_rating[:9]

['418', '410', '349', '343', '307', '252', '243', '242', '236']

In [2529]:
print(len(a_player),len(a_team),len(a_rating))

19 19 19

In [2530]:
Alrounder_=pd.DataFrame({"Player":a_player,"Team":a_team,"Rating":a_rating})
Alrounder_

                   Player Team Rating
0           Ellyse Perry   AUS    418
1        Stafanie Taylor    WI    410
2         Natalie Sciver   ENG    349
3          Deepti Sharma   IND    343
4          Jess Jonassen   AUS    307
5       Ashleigh Gardner   AUS    252
6       Dane van Niekerk    SA    243
7          Sophie Devine    NZ    242
8            Amelia Kerr    NZ    236
9        Katherine Brunt   ENG    236
10         Shikha Pandey   IND    204
11        Jhulan Goswami   IND    200
12        Heather Knight   ENG    189
13          Rumana Ahmed   BAN    179
14       Hayley Matthews    WI    176
15      Harmanpreet Kaur   IND    167
16   Chamari Athapaththu    SL    164
17             Sune Luus    SA    153
18          Poonam Yadav   IND    151

In [2531]:
alrounder_=Alrounder_[:9]
alrounder_

               Player Team Rating
0       Ellyse Perry   AUS    418
1    Stafanie Taylor    WI    410
2     Natalie Sciver   ENG    349
3      Deepti Sharma   IND    343
4      Jess Jonassen   AUS    307
5   Ashleigh Gardner   AUS    252
6   Dane van Niekerk    SA    243
7      Sophie Devine    NZ    242
8        Amelia Kerr    NZ    236

In [2532]:
a_player_banner=[]
a_team_banner=[]
a_rating_banner=[]

In [2533]:
a_player_banner_=soup.find_all('div' ,class_="rankings-block__banner--name-large")
a_player_banner_

In [2534]:
for i in a_player_banner_:
    a_player_banner.append(i.text.replace("\n"," "))
a_player_banner[:1]

['Marizanne Kapp']

In [2535]:
a_team_banner_=soup.find_all('div' ,class_="rankings-block__banner--nationality")
a_team_banner_

[<div class="rankings-block__banner--nationality">
 <div class="flag-15 SA"></div>
 <span class="rankings-block__banner--nation"></span>SA
                     </div>]

In [2536]:
for i in a_team_banner_:
    a_team_banner.append(i.text.strip())
a_team_banner

['SA']

In [2537]:
a_rating_banner_=soup.find_all('div' ,class_="rankings-block__banner--rating")
a_rating_banner_

In [2538]:
for i in a_rating_banner_:
    a_rating_banner.append(i.text.replace("\n"," "))
a_rating_banner

['418']

In [2539]:
a_banner=pd.DataFrame({"Player":a_player_banner[:1],"Team":a_team_banner,"Rating":a_rating_banner})
a_banner

           Player Team Rating
0  Marizanne Kapp   SA    418

In [2540]:
alrounder=a_banner.append(alrounder_,ignore_index=True)
alrounder

               Player Team Rating
0      Marizanne Kapp   SA    418
1       Ellyse Perry   AUS    418
2    Stafanie Taylor    WI    410
3     Natalie Sciver   ENG    349
4      Deepti Sharma   IND    343
5      Jess Jonassen   AUS    307
6   Ashleigh Gardner   AUS    252
7   Dane van Niekerk    SA    243
8      Sophie Devine    NZ    242
9        Amelia Kerr    NZ    236

7. Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [2541]:
url=requests.get("https://www.amazon.in/s?k=mobile&rh=p_36%3A-20000000&qid=1621975129&rnid=1318502031&ref=sr_nr_p_36_5")
url

In [2542]:
soup=BeautifulSoup(url.content)
#soup

In [2543]:
mobile=[]
price=[]
rating=[]
image=[]

In [2544]:
mobile_=soup.find_all("span",class_="a-size-medium a-color-base a-text-normal")
#mobile_

In [2545]:
for i in mobile_:
    mobile.append(i.text.replace("\n"," "))
mobile[:9]

[]

In [2546]:
price_=soup.find_all("span", class_="a-price-whole")
#price_

In [2547]:
for i in price_:
    price.append(i.text.replace("\n"," "))
price[:9]

[]

In [2548]:
rating_=soup.find_all('span', class_="a-icon-alt")
rating_[:9]

[]

In [2549]:
for i in rating_:
    rating.append(i.text.replace("\n"," "))
rating[:9]

[]

In [2550]:
image_=soup.find_all("img",class_="s-image")
image_[:1]

[]

In [2551]:
for i in image_:
    image.append(i.get('srcset'))
image[:2]

[]

In [2552]:
Amazon=pd.DataFrame({"Mobile":mobile[:9],"Price":price[:9],"Rating":rating[:9],"Image":image[:9]})

In [2553]:
Amazon

Empty DataFrame
Columns: [Mobile, Price, Rating, Image]
Index: []

8. Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.

In [2554]:
url=requests.get("https://forecast.weather.gov/MapClick.php?lat=37.777120000000025&lon=-122.41963999999996#.YK1i9agzZPZ")
url

In [2555]:
soup=BeautifulSoup(url.content)

In [2556]:
day=[]
temp=[]
desc=[]

In [2557]:
day_=soup.find_all('p' ,class_="period-name")
day_

[<p class="period-name">Today<br/><br/></p>,
 <p class="period-name">Tonight<br/><br/></p>,
 <p class="period-name">Sunday<br/><br/></p>,
 <p class="period-name">Sunday<br/>Night</p>,
 <p class="period-name">Monday<br/><br/></p>,
 <p class="period-name">Monday<br/>Night</p>,
 <p class="period-name">Tuesday<br/><br/></p>,
 <p class="period-name">Tuesday<br/>Night</p>,
 <p class="period-name">Wednesday<br/><br/></p>]

In [2558]:
for i in range(0,len(day_),2):
    day.append(day_[i].text.replace("\n"," "))
day

['Today', 'Sunday', 'Monday', 'Tuesday', 'Wednesday']

In [2559]:
temp_=soup.find_all("p", class_="temp temp-high")
temp_

[<p class="temp temp-high">High: 60 °F</p>,
 <p class="temp temp-high">High: 58 °F</p>,
 <p class="temp temp-high">High: 63 °F</p>,
 <p class="temp temp-high">High: 63 °F</p>,
 <p class="temp temp-high">High: 63 °F</p>]

In [2560]:
for i in temp_:
    temp.append(i.text.replace("\n"," "))
temp

['High: 60 °F', 'High: 58 °F', 'High: 63 °F', 'High: 63 °F', 'High: 63 °F']

In [2561]:
desc_=soup.find_all("p", class_="short-desc")
desc_

[<p class="short-desc">Mostly Sunny</p>,
 <p class="short-desc">Mostly Clear</p>,
 <p class="short-desc">Sunny then<br/>Sunny and<br/>Breezy</p>,
 <p class="short-desc">Mostly Clear<br/>and Breezy<br/>then Mostly<br/>Clear</p>,
 <p class="short-desc">Sunny and<br/>Breezy</p>,
 <p class="short-desc">Mostly Clear<br/>and Breezy<br/>then Partly<br/>Cloudy</p>,
 <p class="short-desc">Sunny</p>,
 <p class="short-desc">Partly Cloudy</p>,
 <p class="short-desc">Sunny</p>]

In [2562]:
for i in range(0,len(desc_),2):
    desc.append(desc_[i].text.replace("\n"," "))
desc

['Mostly Sunny',
 'Sunny thenSunny andBreezy',
 'Sunny andBreezy',
 'Sunny',
 'Sunny']

In [2563]:
climate=pd.DataFrame({"Day":day,"Temparature":temp,"Description":desc})
climate

         Day  Temparature                Description
0      Today  High: 60 °F               Mostly Sunny
1     Sunday  High: 58 °F  Sunny thenSunny andBreezy
2     Monday  High: 63 °F            Sunny andBreezy
3    Tuesday  High: 63 °F                      Sunny
4  Wednesday  High: 63 °F                      Sunny

9. Write a python program to scrape fresher job listings from ‘https://internshala.com/’. It should include job title, company name, CTC, and apply date.

In [2564]:
url=requests.get("https://internshala.com/fresher-jobs")
url

In [2565]:
soup=BeautifulSoup(url.content)

In [2566]:
title = []
company = []
ctc = []
apply_date = []

In [2567]:
title_=soup.find_all('div' ,class_="heading_4_5 profile")

In [2568]:
for i in title_:
    title.append(i.text.replace("\n"," "))
title[:10]

[' PHP & LARAVEL DEVELOPER ',
 ' Backend Developer (Ruby On Rails) ',
 ' Customer Service Specialist ',
 ' Graphic Designer ',
 ' Digital Marketing Specialist ',
 ' Junior Corporate Sales Executive ',
 ' Backend Developer ',
 ' Junior Operations Executive ',
 ' Internal Audit Associate ',
 ' Business Marketing Manager ']

In [2569]:
company_=soup.find_all("a", class_="link_display_like_text")
company_[:10]

[<a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Nyx%20Wolves">
                         Nyx Wolves                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Wollfish%20Labs%20Private%20Limited">
                         Wollfish Labs Private Limited                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Wono%20Inc">
                         Wono Inc                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Wono%20Inc">
                         Wono Inc                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Wono%20Inc">
                         Wono Inc                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Wyntem">
                         Wyntem                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-HomeJam">
                         HomeJam                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-NCTI%20LLP">
                         NCTI LLP                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-Global%20Group">
                         Global Group                    </a>,
 <a class="link_display_like_text" href="/fresher-jobs/fresher-job-at-MentorBoxx">
                         MentorBoxx                    </a>]

In [2570]:
for i in company_:
    company.append(i.text.replace("\n"," "))
company[:10]

['                         Nyx Wolves                    ',
 '                         Wollfish Labs Private Limited                    ',
 '                         Wono Inc                    ',
 '                         Wono Inc                    ',
 '                         Wono Inc                    ',
 '                         Wyntem                    ',
 '                         HomeJam                    ',
 '                         NCTI LLP                    ',
 '                         Global Group                    ',
 '                         MentorBoxx                    ']

In [2571]:
ctc_=soup.find_all('div' ,class_="item_body",id=False)
ctc_[:10]

[<div class="item_body">
 <i class="ic-16-currency-inr"></i>  3 - 3.05 LPA                                                    </div>,
 <div class="item_body">4 Jul' 21</div>,
 <div class="item_body">
 <i class="ic-16-currency-inr"></i>  6 - 8 LPA                                                    </div>,
 <div class="item_body">4 Jul' 21</div>,
 <div class="item_body">
 <i class="ic-16-currency-inr"></i>  5.2 - 6.4 LPA                                                    </div>,
 <div class="item_body">3 Jul' 21</div>,
 <div class="item_body">
 <i class="ic-16-currency-inr"></i>  5 - 6.5 LPA                                                    </div>,
 <div class="item_body">3 Jul' 21</div>,
 <div class="item_body">
 <i class="ic-16-currency-inr"></i>  5 - 6.5 LPA                                                    </div>,
 <div class="item_body">3 Jul' 21</div>]

In [2572]:

for i in ctc_:
    ctc.append(i.text.replace("\n"," ").replace("Starts\xa0Immediately ","  "))
ctc[:20]

['   3 - 3.05 LPA                                                    ',
 "4 Jul' 21",
 '   6 - 8 LPA                                                    ',
 "4 Jul' 21",
 '   5.2 - 6.4 LPA                                                    ',
 "3 Jul' 21",
 '   5 - 6.5 LPA                                                    ',
 "3 Jul' 21",
 '   5 - 6.5 LPA                                                    ',
 "3 Jul' 21",
 '   3 - 3.5 LPA                                                    ',
 "3 Jul' 21",
 '   7 - 8.5 LPA                                                    ',
 "3 Jul' 21",
 '   3 - 3.6 LPA                                                    ',
 "3 Jul' 21",
 '   4.8 - 6 LPA                                                    ',
 "3 Jul' 21",
 '   4 - 8.5 LPA                                                    ',
 "3 Jul' 21"]

In [2573]:
ctc1=[]
for i in range(0,len(ctc),2):
    ctc1.append(ctc[i].strip())
ctc1[:10]

['3 - 3.05 LPA',
 '6 - 8 LPA',
 '5.2 - 6.4 LPA',
 '5 - 6.5 LPA',
 '5 - 6.5 LPA',
 '3 - 3.5 LPA',
 '7 - 8.5 LPA',
 '3 - 3.6 LPA',
 '4.8 - 6 LPA',
 '4 - 8.5 LPA']

In [2574]:
for i in range(1,len(ctc),2):
    apply_date.append(ctc[i].strip())
apply_date[:10]

["4 Jul' 21",
 "4 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21",
 "3 Jul' 21"]

In [2575]:
db=pd.DataFrame({"Title":title[:10],"Company":company[:10],"CTC":ctc1[:10],"Apply Date":apply_date[:10]})
db

,Title,Company,CTC,Apply Date
0,PHP & LARAVEL DEVELOPER,Nyx Wolves ...,3 - 3.05 LPA,4 Jul' 21
1,Backend Developer (Ruby On Rails),Wollfish Labs Private...,6 - 8 LPA,4 Jul' 21
2,Customer Service Specialist,Wono Inc ...,5.2 - 6.4 LPA,3 Jul' 21
3,Graphic Designer,Wono Inc ...,5 - 6.5 LPA,3 Jul' 21
4,Digital Marketing Specialist,Wono Inc ...,5 - 6.5 LPA,3 Jul' 21
5,Junior Corporate Sales Executive,Wyntem ...,3 - 3.5 LPA,3 Jul' 21
6,Backend Developer,HomeJam ...,7 - 8.5 LPA,3 Jul' 21
7,Junior Operations Executive,NCTI LLP ...,3 - 3.6 LPA,3 Jul' 21
8,Internal Audit Associate,Global Group ...,4.8 - 6 LPA,3 Jul' 21
9,Business Marketing Manager,MentorBoxx ...,4 - 8.5 LPA,3 Jul' 21